zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxHsct_bf.h
/** \brief Length for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQEN_Bits.SFOEN */
#define IFX_HSCT_IRQEN_SFOEN_OFF (11u)

/** \brief Length for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQEN_Bits.SFUEN */
#define IFX_HSCT_IRQEN_SFUEN_OFF (12u)

/** \brief Length for Ifx_HSCT_IRQEN_Bits.MSCEEN */
#define IFX_HSCT_IRQEN_MSCEEN_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQEN_Bits.MSCEEN */
#define IFX_HSCT_IRQEN_MSCEEN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQEN_Bits.MSCEEN */
#define IFX_HSCT_IRQEN_MSCEEN_OFF (13u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.HERCLR */
#define IFX_HSCT_IRQCLR_HERCLR_OFF (1u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.PYERCLR */
#define IFX_HSCT_IRQCLR_PYERCLR_OFF (2u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.CERCLR */
#define IFX_HSCT_IRQCLR_CERCLR_OFF (3u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.IFCFSCLR */
#define IFX_HSCT_IRQCLR_IFCFSCLR_OFF (4u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.SMERCLR */
#define IFX_HSCT_IRQCLR_SMERCLR_OFF (5u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.USMSFCLR */
#define IFX_HSCT_IRQCLR_USMSFCLR_OFF (6u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.PLERCLR */
#define IFX_HSCT_IRQCLR_PLERCLR_OFF (7u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.USMCLR */
#define IFX_HSCT_IRQCLR_USMCLR_OFF (8u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.PARCLR */
#define IFX_HSCT_IRQCLR_PARCLR_OFF (9u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.TXTECLR */
#define IFX_HSCT_IRQCLR_TXTECLR_OFF (10u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.SFOCLR */
#define IFX_HSCT_IRQCLR_SFOCLR_OFF (11u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.SFUCLR */
#define IFX_HSCT_IRQCLR_SFUCLR_OFF (12u)

/** \brief Length for Ifx_HSCT_IRQCLR_Bits.MSCELR */
#define IFX_HSCT_IRQCLR_MSCELR_LEN (1u)

/** \brief Mask for Ifx_HSCT_IRQCLR_Bits.MSCELR */
#define IFX_HSCT_IRQCLR_MSCELR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IRQCLR_Bits.MSCELR */
#define IFX_HSCT_IRQCLR_MSCELR_OFF (13u)

/** \brief Length for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_LEN (32u)

/** \brief Mask for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSCT_USMR_Bits.USMR */
#define IFX_HSCT_USMR_USMR_OFF (0u)

/** \brief Length for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_LEN (32u)

/** \brief Mask for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_MSK (0xffffffffu)

/** \brief Offset for Ifx_HSCT_USMS_Bits.USMS */
#define IFX_HSCT_USMS_USMS_OFF (0u)

/** \brief Length for Ifx_HSCT_TESTCTRL_Bits.TXENS */
#define IFX_HSCT_TESTCTRL_TXENS_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTCTRL_Bits.TXENS */
#define IFX_HSCT_TESTCTRL_TXENS_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTCTRL_Bits.TXENS */
#define IFX_HSCT_TESTCTRL_TXENS_OFF (0u)

/** \brief Length for Ifx_HSCT_TESTCTRL_Bits.TXDISS */
#define IFX_HSCT_TESTCTRL_TXDISS_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTCTRL_Bits.TXDISS */
#define IFX_HSCT_TESTCTRL_TXDISS_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTCTRL_Bits.TXDISS */
#define IFX_HSCT_TESTCTRL_TXDISS_OFF (1u)

/** \brief Length for Ifx_HSCT_TESTCTRL_Bits.LLOPTXRX */
#define IFX_HSCT_TESTCTRL_LLOPTXRX_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTCTRL_Bits.LLOPTXRX */
#define IFX_HSCT_TESTCTRL_LLOPTXRX_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTCTRL_Bits.LLOPTXRX */
#define IFX_HSCT_TESTCTRL_LLOPTXRX_OFF (2u)

/** \brief Length for Ifx_HSCT_TESTCTRL_Bits.PRBSEN */
#define IFX_HSCT_TESTCTRL_PRBSEN_LEN (1u)

